# CutLineType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CutLineType Property
ParameterTypeId Class See Also
---
"Cut Line Type"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CutLineType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CutLineType As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CutLineType {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace